In [1]:
#Importamos la librería pandas que necesitamos para la lectura, conversión y limpieza de los datos.
import pandas as pd
import numpy as np
import re 

pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames
# pd.set_option('display.max_rows', None) # para poder visualizar todas las filas de los DataFrames

In [2]:
#Abrimos el csv y lo convertimos a un DataFrame.
df_HR = pd.read_csv('HR_RAW_DATA.csv', index_col= 0)
df_HR.sample(10)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
185,41,No,travel_rarely,"465,0$",Research & Development,-34,3,Life Sciences,1,"227,0",1,0,56,3,1,RESEaRch SCIEntISt,3,Divorced,NaN,4609,4,Y,No,12,"3,0",1,NaN,1,NaN,2,"3,0",9,NaN,1,8,NaN,1982,1000000000$,RESEaRch SCIEntISt - Research & Development,NaN,1
620,46,No,NaN,"168,0$",Sales,4,2,NaN,1,"1280,0",4,1,33,2,5,MaNAgeR,2,Married,"18789,0",9946,2,Y,NaN,14,"3,0",3,NaN,1,NaN,2,"3,0",11,NaN,0,8,"18789,0",1977,1000000000$,MaNAgeR - Sales,NaN,1
1459,58,No,NaN,"605,0$",NaN,21,3,NaN,1,"1938,0",4,1,72,3,4,MAnAGeR,4,NaN,NaN,11761,4,NaN,Yes,13,"3,0",3,NaN,1,NaN,2,"2,0",1,NaN,0,0,NaN,1965,1000000000$,NaN,NaN,Yes
614,35,No,travel_rarely,"528,0$",NaN,8,4,Technical Degree,1,NaN,3,0,100,3,1,HUMaN RESoUrCES,3,NaN,"4323,0",7108,1,Y,No,17,"3,0",2,NaN,0,"6,0",2,"1,0",5,NaN,1,4,"4323,0",1988,1000000000$,NaN,NaN,1
6,59,No,NaN,"1435,0$",NaN,25,3,Life Sciences,1,"81,0",1,1,99,3,3,Sales ExeCutIVe,1,NaN,NaN,2354,7,Y,NaN,11,"3,0",4,NaN,0,"28,0",3,"2,0",21,NaN,7,9,NaN,1964,1000000000$,NaN,NaN,True
1187,43,No,NaN,nan$,NaN,14,2,Life Sciences,1,NaN,2,0,94,3,4,REseArCH DIrecTOr,1,NaN,"17159,0",5200,6,Y,No,24,"4,0",3,NaN,1,NaN,3,"3,0",4,NaN,1,0,"17159,0",1980,1000000000$,NaN,NaN,0
715,42,No,NaN,"932,0$",NaN,1,2,Life Sciences,1,"827,0",4,1,43,2,2,manUfAcTurInG dIrEctOr,4,Married,"6062,0",4051,9,NaN,NaN,13,"3,0",4,NaN,1,"8,0",4,"3,0",4,NaN,0,2,"6062,0",1981,1000000000$,NaN,NaN,0
1523,21,Yes,NaN,"756,0$",NaN,1,1,NaN,1,"478,0",1,1,99,2,1,saLes represEnTAtIVE,2,Single,"2174,0",9150,1,NaN,NaN,11,"3,0",3,NaN,0,"3,0",3,"3,0",3,NaN,1,2,"2174,0",2002,1000000000$,NaN,NaN,0
708,23,No,travel_rarely,"650,0$",NaN,-49,1,NaN,1,"758,0",2,0,37,3,1,LABOrATORy TEchNICian,1,NaN,NaN,4344,1,NaN,No,14,"3,0",4,"80,0",1,"5,0",2,"4,0",4,NaN,0,2,NaN,2000,1000000000$,NaN,NaN,True
789,44,No,NaN,"1037,0$",NaN,1,3,Medical,1,NaN,2,0,42,3,1,reseaRch ScIeNTist,4,Single,NaN,13422,6,NaN,Yes,12,"3,0",3,NaN,0,"6,0",2,"3,0",4,NaN,1,2,NaN,1979,1000000000$,NaN,NaN,Yes

In [3]:
#FASE 1.
#Creamos la función para leer el archivo csv.
def lectura_archivo(csv):
    data = pd.read_csv(csv, index_col= 0)
    return data

In [4]:
# lectura_archivo('HR_RAW_DATA.csv')

In [5]:
#Creamos la función para explorar los datos. 

def exploracion_datos(df):
    print('_____________ INFORMACIÓN GENERAL DEL DATAFRAME ____________\n')
    print(df.info())

    print('___________________ FORMA DEL DATAFRAME ____________________\n')
    
    print(f"El número de filas que tenemos es de {df.shape[0]}.\nEl número de columnas es de {df.shape[1]}\n")
    

    print('_______________ NULOS, ÚNICOS Y DUPLICADOS _________________\n')
    
    print('La cantidad de valores NULOS por columna es de:\n')
    print(df.isnull().sum())
    print('____________________________________________________________\n')

    print('La cantidad de valores ÚNICOS por columna es de:\n')
        
    for columna in df.columns:
        cantidad_valores_unicos = len(df[columna].unique())
    
        print(f'La columna {columna}: {cantidad_valores_unicos}')

    """ Otra forma más rápida de obtener la lista de valores únicos por columna es usando df.nunique()"""

    print('____________________________________________________________\n')

    print('La cantidad de valores DUPLICADOS por columna es de:\n')

    """En análisis posteriores hemos detectado que hay columnas con valores duplicados que nos interesa filtrar, 
    así que vamos a realizar otro bucle for para iterar por todas las columnas del DF y obtener los duplicados de cada una de ellas."""

    for columna in df.columns:
        cantidad_duplicados = df[columna].duplicated().sum()
    
        print(f'La columna {columna}: {cantidad_duplicados}')


    print('____________________ RESUMEN ESTADÍSTICO ____________________')
    print('____________________ Variables Numéricas __________________\n')
    print(df.describe().T)
    
    print('___________________ Variables Categóricas _________________\n')
    print(df.describe(include='object').T)

In [6]:
exploracion_datos(df_HR)

_____________ INFORMACIÓN GENERAL DEL DATAFRAME ____________

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1614 non-null   object
 1   Attrition                 1614 non-null   object
 2   BusinessTravel            842 non-null    object
 3   DailyRate                 1614 non-null   object
 4   Department                302 non-null    object
 5   DistanceFromHome          1614 non-null   int64
 6   Education                 1614 non-null   int64
 7   EducationField            869 non-null    object
 8   employeecount             1614 non-null   int64
 9   employeenumber            1183 non-null   object
 10  EnvironmentSatisfaction   1614 non-null   int64
 11  Gender                    1614 non-null   int64
 12  HourlyRate                1614 non-null   object
 13  JobInvolvement            1614 non-null   int64
 14  JobLevel                  1614 non-null   int64
 15  JobRole                   1614 non-null   object
 16  JobSatisfaction           1614 non-null   int64
 17  MaritalStatus             963 non-null    object
 18  MonthlyIncome             771 non-null    object
 19  MonthlyRate               1614 non-null   int64
 20  NUMCOMPANIESWORKED        1614 non-null   int64
 21  Over18                    713 non-null    object
 22  OverTime                  938 non-null    object
 23  PercentSalaryHike         1614 non-null   int64
 24  PerformanceRating         1419 non-null   object
 25  RelationshipSatisfaction  1614 non-null   int64
 26  StandardHours             419 non-null    object
 27  StockOptionLevel          1614 non-null   int64
 28  TOTALWORKINGYEARS         1088 non-null   object
 29  TrainingTimesLastYear     1614 non-null   int64
 30  WORKLIFEBALANCE           1506 non-null   object
 31  YearsAtCompany            1614 non-null   int64
 32  YearsInCurrentRole        34 non-null     object
 33  YearsSinceLastPromotion   1614 non-null   int64
 34  YEARSWITHCURRMANAGER      1614 non-null   int64
 35  SameAsMonthlyIncome       771 non-null    object
 36  DateBirth                 1614 non-null   int64
 37  Salary                    1614 non-null   object
 38  RoleDepartament           302 non-null    object
 39  NUMBERCHILDREN            0 non-null      float64
 40  RemoteWork                1614 non-null   object
dtypes: float64(1), int64(18), object(22)
memory usage: 529.6+ KB
None
___________________ FORMA DEL DATAFRAME ____________________

El número de filas que tenemos es de 1614.
El número de columnas es de 41

_______________ NULOS, ÚNICOS Y DUPLICADOS _________________

La cantidad de valores NULOS por columna es de:

Age                            0
Attrition                      0
BusinessTravel               772
DailyRate                      0
Department                  1312
DistanceFromHome               0
Education                      0
EducationField               745
employeecount                  0
employeenumber               431
EnvironmentSatisfaction        0
Gender                         0
HourlyRate                     0
JobInvolvement                 0
JobLevel                       0
JobRole                        0
JobSatisfaction                0
MaritalStatus                651
MonthlyIncome                843
MonthlyRate                    0
NUMCOMPANIESWORKED             0
Over18                       901
OverTime                     676
PercentSalaryHike              0
PerformanceRating            195
RelationshipSatisfaction       0
StandardHours               1195
StockOptionLevel               0
TOTALWORKINGYEARS            526
TrainingTimesLastYear          0
WORKLIFEBALANCE              108
YearsAtCompany                 0
YearsInCurrentRole          1580
YearsSinceLastPromotion        0
YEARSWITHCURRMANAGER           0
SameAsMonthlyIncome          843
DateBirth                      0
Salary                         0
RoleDepartament             1312
NUMBERCHILDREN              1614
RemoteWork                     0
dtype: int64
____________________________________________________________

La cantidad de valores ÚNICOS por columna es de:

La columna Age: 54
La columna Attrition: 2
La columna BusinessTravel: 4
La columna DailyRate: 849
La columna Department: 4
La columna DistanceFromHome: 69
La columna Education: 5
La columna EducationField: 7
La columna employeecount: 1
La columna employeenumber: 1080
La columna EnvironmentSatisfaction: 38
La columna Gender: 2
La columna HourlyRate: 72
La columna JobInvolvement: 4
La columna JobLevel: 5
La columna JobRole: 1579
La columna JobSatisfaction: 4
La columna MaritalStatus: 6
La columna MonthlyIncome: 669
La columna MonthlyRate: 1427
La columna NUMCOMPANIESWORKED: 10
La columna Over18: 2
La columna OverTime: 3
La columna PercentSalaryHike: 15
La columna PerformanceRating: 3
La columna RelationshipSatisfaction: 4
La columna StandardHours: 2
La columna StockOptionLevel: 4
La columna TOTALWORKINGYEARS: 41
La columna TrainingTimesLastYear: 7
La columna WORKLIFEBALANCE: 5
La columna YearsAtCompany: 37
La columna YearsInCurrentRole: 11
La columna YearsSinceLastPromotion: 16
La columna YEARSWITHCURRMANAGER: 18
La columna SameAsMonthlyIncome: 669
La columna DateBirth: 43
La columna Salary: 1
La columna RoleDepartament: 302
La columna NUMBERCHILDREN: 1
La columna RemoteWork: 5
____________________________________________________________

La cantidad de valores DUPLICADOS por columna es de:

La columna Age: 1560
La columna Attrition: 1612
La columna BusinessTravel: 1610
La columna DailyRate: 765
La columna Department: 1610
La columna DistanceFromHome: 1545
La columna Education: 1609
La columna EducationField: 1607
La columna employeecount: 1613
La columna employeenumber: 534
La columna EnvironmentSatisfaction: 1576
La columna Gender: 1612
La columna HourlyRate: 1542
La columna JobInvolvement: 1610
La columna JobLevel: 1609
La columna JobRole: 35
La columna JobSatisfaction: 1610
La columna MaritalStatus: 1608
La columna MonthlyIncome: 945
La columna MonthlyRate: 187
La columna NUMCOMPANIESWORKED: 1604
La columna Over18: 1612
La columna OverTime: 1611
La columna PercentSalaryHike: 1599
La columna PerformanceRating: 1611
La columna RelationshipSatisfaction: 1610
La columna StandardHours: 1612
La columna StockOptionLevel: 1610
La columna TOTALWORKINGYEARS: 1573
La columna TrainingTimesLastYear: 1607
La columna WORKLIFEBALANCE: 1609
La columna YearsAtCompany: 1577
La columna YearsInCurrentRole: 1603
La columna YearsSinceLastPromotion: 1598
La columna YEARSWITHCURRMANAGER: 1596
La columna SameAsMonthlyIncome: 945
La columna DateBirth: 1571
La columna Salary: 1613
La columna RoleDepartament: 1312
La columna NUMBERCHILDREN: 1613
La columna RemoteWork: 1609
____________________ RESUMEN ESTADÍSTICO ____________________
____________________ Variables Numéricas __________________

                           count          mean          std     min     25%  \
DistanceFromHome          1614.0      4.527261    14.591913   -49.0     2.0
Education                 1614.0      2.925031     1.022357     1.0     2.0
employeecount             1614.0      1.000000     0.000000     1.0     1.0
EnvironmentSatisfaction   1614.0      4.294919     6.993559     1.0     2.0
Gender                    1614.0      0.398389     0.489718     0.0     0.0
JobInvolvement            1614.0      2.739777     0.711567     1.0     2.0
JobLevel                  1614.0      2.068154     1.101344     1.0     1.0
JobSatisfaction           1614.0      2.738538     1.106163     1.0     2.0
MonthlyRate               1614.0  14284.495663  7110.414585  2094.0  8001.0
NUMCOMPANIESWORKED        1614.0      2.673482     2.506152     0.0     1.0
PercentSalaryHike         1614.0     15.165428     3.648610    11.0    12.0
RelationshipSatisfaction  1614.0      2.704461     1.079031     1.0     2.0
StockOptionLevel          1614.0      0.791202     0.842396     0.0     0.0
TrainingTimesLastYear     1614.0      2.809789     1.297765     0.0     2.0
YearsAtCompany            1614.0      7.132590     6.124237     0.0     3.0
YearsSinceLastPromotion   1614.0      2.245973     3.235665     0.0     0.0
YEARSWITHCURRMANAGER      1614.0      4.220570     3.562695     0.0     2.0
DateBirth                 1614.0   1986.076208     9.101332  1963.0  1980.0
NUMBERCHILDREN               0.0           NaN          NaN     NaN     NaN

                              50%      75%      max
DistanceFromHome              5.0     11.0     29.0
Education                     3.0      4.0      5.0
employeecount                 1.0      1.0      1.0
EnvironmentSatisfaction       3.0      4.0     49.0
Gender                        0.0      1.0      1.0
JobInvolvement                3.0      3.0      4.0
JobLevel                      2.0      3.0      5.0
JobSatisfaction               3.0      4.0      4.0
MonthlyRate               14248.5  20364.0  26999.0
NUMCOMPANIESWORKED            2.0      4.0      9.0
PercentSalaryHike            14.0     18.0     25.0
RelationshipSatisfaction      3.0      4.0      4.0
StockOptionLevel              1.0      1.0      3.0
TrainingTimesLastYear         3.0      3.0      6.0
YearsAtCompany                5.0      9.0     40.0
YearsSinceLastPromotion       1.0      3.0     15.0
YEARSWITHCURRMANAGER          3.0      7.0     17.0
DateBirth                  1987.0   1993.0   2005.0
NUMBERCHILDREN                NaN      NaN      NaN
___________________ Variables Categóricas _________________

                    count unique                       top  freq
Age                  1614     54                        35    84
Attrition            1614      2                        No  1355
BusinessTravel        842      3             travel_rarely   586
DailyRate            1614    849                      nan$   124
Department            302      3   Research & Development    196
EducationField        869      6             Life Sciences   349
employeenumber       1183   1079                     482,0     2
HourlyRate           1614     72             Not Available    84
JobRole              1614   1579                  mANager      4
MaritalStatus         963      5                   Married   404
MonthlyIncome         771    668                    6347,0     4
Over18                713      1                         Y   713
OverTime              938      2                        No   682
PerformanceRating    1419      2                       3,0  1205
StandardHours         419      1                      80,0   419
TOTALWORKINGYEARS    1088     40                      10,0   144
WORKLIFEBALANCE      1506      4                       3,0   913
YearsInCurrentRole     34     10                       2,0    11
SameAsMonthlyIncome   771    668                    6347,0     4
Salary               1614      1               1000000000$  1614
RoleDepartament       302    301        MaNAgeR  -  Sales      2
RemoteWork           1614      5                         1   360

In [7]:
#FASE 2
""" ¿Qué hacemos con la columna del id de empleados que tiene duplicados? """
df_HR['employeenumber'].duplicated().sum()

534

In [8]:
#employeecount: esta columna tiene el mismo valor para todas las filas, por lo que es redundante y se puede eliminar.¿¿??
df_HR['employeecount'].unique()

array([1])

In [9]:
#Eliminamos la columna "employeecount"
df_HR.drop(columns='employeecount', inplace= True)

In [10]:
#NUMBERCHILDREN: Tiene solo valores nulos, se puede eliminar.
df_HR['NUMBERCHILDREN'].isnull().sum()

1614

In [11]:
#Eliminamos la columna "NUMBERCHILDREN"
df_HR.drop(columns='NUMBERCHILDREN', inplace= True)

In [12]:
#SameAsMonthlyIncome: parece un duplicado de la columna MonthlyIncome,se puede eliminar. 
df_HR[['SameAsMonthlyIncome', 'MonthlyIncome', 'MonthlyRate', 'HourlyRate']]

     SameAsMonthlyIncome MonthlyIncome  MonthlyRate HourlyRate
0                19537,0       19537,0         6462         51
1                19999,0       19999,0         5678         65
2                19232,0       19232,0         4933         58
3                17169,0       17169,0        26703         82
4                    NaN           NaN         7739         45
...                  ...           ...          ...        ...
1609             10325,0       10325,0         5518         51
1610              4447,0        4447,0        23163         57
1611                 NaN           NaN         2560         41
1612                 NaN           NaN        25952         84
1613             10845,0       10845,0        24208         75

[1614 rows x 4 columns]

In [13]:
#Eliminamos la columna
df_HR.drop(columns='SameAsMonthlyIncome', inplace= True)
#Buscamos nombre columnas para comprobar que la hemos eliminado.

In [14]:
#Salary: Tiene un solo valor repetido, por lo que se puede eliminar también.
df_HR['Salary'].unique()

array(['1000000000$'], dtype=object)

In [15]:
#Eliminamos la columna "Salary"
df_HR.drop(columns='Salary', inplace= True)

In [16]:
#Reemplazamos los valores 1 y 0 de la columna Gender por "M" de masculino y "F" de femenino, usando loc.

df_HR.loc[df_HR['Gender'] == 0, 'Gender'] = 'M'
df_HR.loc[df_HR['Gender'] == 1, 'Gender'] = 'F'

print(df_HR['Gender'])

0       M
1       M
2       M
3       F
4       F
       ..
1609    M
1610    M
1611    M
1612    M
1613    M
Name: Gender, Length: 1614, dtype: object

### Función para cambiar a FLOAT

In [17]:
# Creamos la función 'cambiar comas'

lista_tofloat = ['DailyRate', 'HourlyRate', 'MonthlyIncome']

def cambiar_comas(cadena):
     # Remover el símbolo $, reemplazar comas por puntos
     # Usar expresiones regulares para mantener solo los números y puntos
    try:
    # Remover cualquier caracter que no sea dígito o coma
        cleaned_string = re.sub(r'[^\d,]', '', cadena)
        # Reemplazar comas por puntos
        cleaned_string = cleaned_string.replace(",", ".")
        # Convertir a float
        return float(cleaned_string)
    except:
        return np.nan # Devuelve un np.nan si hay un valor inválido

# Aplicar la función a cada columna en la lista
for col in lista_tofloat:
    df_HR[col] = df_HR[col].apply(cambiar_comas)


# Comprobamos que la columna, que antes era de tipo string, ahora es float64.
df_HR[lista_tofloat].dtypes

DailyRate        float64
HourlyRate       float64
MonthlyIncome    float64
dtype: object

In [18]:
df_HR.head(10)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,DateBirth,RoleDepartament,RemoteWork
0,51,No,NaN,684.0,NaN,6,3,NaN,"162,0",1,M,51.0,3,5,resEArch DIREcToR,3,NaN,19537.0,6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,1972,NaN,Yes
1,52,No,NaN,699.0,NaN,1,4,Life Sciences,"259,0",3,M,65.0,2,5,ManAGeR,3,NaN,19999.0,5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,1971,NaN,1
2,42,No,travel_rarely,532.0,Research & Development,4,2,Technical Degree,"319,0",3,M,58.0,3,5,ManaGER,4,Married,19232.0,4933,1,NaN,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,1981,ManaGER - Research & Development,1
3,47,No,travel_rarely,359.0,NaN,2,4,Medical,NaN,1,F,82.0,3,4,ReseArCH DIrECtOr,3,Married,17169.0,26703,3,Y,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,1976,NaN,False
4,46,No,NaN,1319.0,NaN,3,3,Technical Degree,NaN,1,F,45.0,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,Y,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,1977,NaN,0
5,48,No,NaN,117.0,Research & Development,22,3,Medical,"1900,0",4,F,58.0,3,4,MANAger,4,NaN,17174.0,2437,3,NaN,No,11,"3,0",2,NaN,1,NaN,3,"3,0",22,NaN,4,7,1975,MANAger - Research & Development,Yes
6,59,No,NaN,1435.0,NaN,25,3,Life Sciences,"81,0",1,F,99.0,3,3,Sales ExeCutIVe,1,NaN,NaN,2354,7,Y,NaN,11,"3,0",4,NaN,0,"28,0",3,"2,0",21,NaN,7,9,1964,NaN,True
7,42,No,travel_rarely,635.0,NaN,1,1,NaN,"387,0",2,M,99.0,3,2,Sales eXEcUTiVe,3,Married,NaN,24532,1,NaN,No,25,"4,0",3,NaN,0,"20,0",3,"3,0",20,NaN,11,6,1981,NaN,0
8,41,No,NaN,1276.0,NaN,2,5,NaN,NaN,2,F,91.0,3,4,mANAGEr,1,Married,16595.0,5626,7,NaN,No,16,"3,0",2,NaN,1,"22,0",2,"3,0",18,NaN,11,8,1982,NaN,True
9,41,No,travel_frequently,840.0,NaN,9,3,NaN,"999,0",1,M,64.0,3,5,reSEaRCH DIrectoR,3,NaN,NaN,3735,2,NaN,No,17,"3,0",2,NaN,1,"21,0",2,"4,0",18,NaN,0,11,1982,NaN,0

In [19]:
#lo guardo para que se guarden los datos

df_HR.to_csv("df_HR_limpio.csv", index = False)

### Función para cambiar a INT

In [20]:
"""# Creamos la función 'cambiar comas'

lista_toint = ['WORKLIFEBALANCE']

def cambiar_comas(cadena):
     # Remover el símbolo $, reemplazar comas por puntos
     # Usar expresiones regulares para mantener solo los números y puntos
    try:
    # Remover cualquier caracter que no sea dígito o coma
        cleaned_string = re.sub(r'[^\d,]', '', cadena)
        # Reemplazar comas por puntos
        cleaned_string = cleaned_string.replace(",", ".")
        # Convertir a float
        return int(cleaned_string)
    except:
        return np.nan # Devuelve un np.nan si hay un valor inválido

# Aplicar la función a cada columna en la lista
for col in lista_toint:
    #convertir a int
    df_HR[col] = df_HR[col].apply(cambiar_comas).astype('Int64')


# Comprobamos que la columna, que antes era de tipo string, ahora es float64.
df_HR[lista_toint].dtypes"""

'# Creamos la función \'cambiar comas\'\n\nlista_toint = [\'WORKLIFEBALANCE\']\n\ndef cambiar_comas(cadena):\n     # Remover el símbolo $, reemplazar comas por puntos\n     # Usar expresiones regulares para mantener solo los números y puntos\n    try:\n    # Remover cualquier caracter que no sea dígito o coma\n        cleaned_string = re.sub(r\'[^\\d,]\', \'\', cadena)\n        # Reemplazar comas por puntos\n        cleaned_string = cleaned_string.replace(",", ".")\n        # Convertir a float\n        return int(cleaned_string)\n    except:\n        return np.nan # Devuelve un np.nan si hay un valor inválido\n\n# Aplicar la función a cada columna en la lista\nfor col in lista_toint:\n    #convertir a int\n    df_HR[col] = df_HR[col].apply(cambiar_comas).astype(\'Int64\')\n\n\n# Comprobamos que la columna, que antes era de tipo string, ahora es float64.\ndf_HR[lista_toint].dtypes'

In [21]:
"""def comasapuntos(num):
    try:
        return float(num.replace(",", "."))
    except:
        return np.nan

columnas = ["WORKLIFEBALANCE"]

for col in columnas:
    df_HR[col] = df_HR[col].apply(comasapuntos)
"""

'def comasapuntos(num):\n    try:\n        return float(num.replace(",", "."))\n    except:\n        return np.nan\n\ncolumnas = ["WORKLIFEBALANCE"]\n\nfor col in columnas:\n    df_HR[col] = df_HR[col].apply(comasapuntos)\n'

In [22]:
df_HR['WORKLIFEBALANCE'] = df_HR['WORKLIFEBALANCE'].replace('NaN', pd.NA)

# Convertir los valores en 'WORKLIFEBALANCE' a float y manejar los NaN
df_HR['WORKLIFEBALANCE'] = df_HR['WORKLIFEBALANCE'].astype(str).str.replace(',', '.').astype(float)

# Convertir los valores a int, ignorando los NaN
df_HR['WORKLIFEBALANCE'] = df_HR['WORKLIFEBALANCE'].astype('Int64')
df_HR['WORKLIFEBALANCE']

0          3
1          3
2       <NA>
3       <NA>
4          3
        ...
1609       3
1610       2
1611       3
1612       3
1613       3
Name: WORKLIFEBALANCE, Length: 1614, dtype: Int64

In [23]:
#pasar a csv para que se guarde

df_HR.to_csv('df_HR_limpio.csv')

In [24]:
df_HR = pd.read_csv('df_HR_limpio.csv')
df_HR.sample(10)

,Unnamed: 0,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,DateBirth,RoleDepartament,RemoteWork
894,894,34,No,NaN,1381.0,NaN,4,4,NaN,"523,0",3,F,72.0,3,2,SaLes exEcUtiVE,3,Married,6538.0,12740,9,Y,No,15,"3,0",1,NaN,1,NaN,3,3.0,3,NaN,1,2,1989,NaN,1
1405,1405,39,No,travel_rarely,1089.0,NaN,6,3,NaN,"1525,0",2,F,32.0,3,3,MAnuFActUring DIrEcToR,2,Single,8376.0,9150,4,Y,NaN,18,NaN,4,NaN,0,"9,0",3,3.0,2,NaN,2,2,1984,NaN,False
1163,1163,40,No,travel_rarely,1322.0,NaN,2,4,NaN,"2048,0",3,M,52.0,2,1,reSearCH sCIentIst,3,NaN,2809.0,2725,2,Y,No,14,"3,0",4,NaN,0,"8,0",2,3.0,2,NaN,2,2,1983,NaN,Yes
1598,1598,36,No,travel_rarely,676.0,NaN,1,3,Other,"823,0",3,F,35.0,3,2,maNUFacturing DiRector,2,NaN,5228.0,23361,0,NaN,NaN,15,"3,0",1,NaN,1,NaN,2,3.0,9,NaN,0,5,1987,NaN,1
1068,1068,31,Yes,travel_frequently,561.0,NaN,3,3,Life Sciences,"1537,0",4,F,33.0,3,1,reSeaRCh scIEntist,3,NaN,NaN,4156,1,Y,No,12,"3,0",1,NaN,0,"7,0",2,NaN,7,NaN,7,7,1992,NaN,1
1577,1577,38,No,travel_rarely,243.0,Sales,7,4,Marketing,NaN,4,F,46.0,2,2,SaLeS exEcUTiVE,4,NaN,NaN,7791,0,NaN,No,20,NaN,1,NaN,0,NaN,2,3.0,7,NaN,0,5,1985,SaLeS exEcUTiVE - Sales,1
842,842,27,No,travel_frequently,472.0,NaN,1,1,NaN,NaN,3,M,60.0,2,2,manuFactuRinG DIrECtor,1,Married,NaN,9679,5,NaN,NaN,19,"3,0",3,NaN,1,NaN,1,3.0,2,NaN,2,0,1996,NaN,0
526,526,45,No,NaN,1316.0,NaN,29,3,NaN,NaN,3,M,83.0,3,1,rESEArch SciEntIST,4,Single,3452.0,9752,5,NaN,NaN,13,"3,0",2,NaN,0,"9,0",2,2.0,6,NaN,0,3,1978,NaN,1
378,378,40,No,travel_rarely,300.0,NaN,26,3,NaN,NaN,3,M,74.0,3,2,SAles ExECutiVE,1,Married,NaN,22217,1,NaN,NaN,14,"3,0",2,"80,0",1,"8,0",3,2.0,7,NaN,7,5,1983,NaN,0
762,762,53,No,travel_rarely,1395.0,NaN,24,4,Medical,"1689,0",2,M,48.0,4,3,hEaLthcARE repreSenTATIvE,4,Married,NaN,3458,3,Y,No,15,"3,0",3,NaN,0,"11,0",2,3.0,4,NaN,1,2,1970,NaN,False

In [25]:
#Cambiamos el tipo de dato de la columna Age para que sea interger.

df_HR.loc[df_HR['Age'] == 'forty-seven', 'Age'] = '47'
df_HR.loc[df_HR['Age'] == 'fifty-eight', 'Age'] = '58'
df_HR.loc[df_HR['Age'] == 'thirty-six', 'Age'] = '36'
df_HR.loc[df_HR['Age'] == 'fifty-five', 'Age'] = '55'
df_HR.loc[df_HR['Age'] == 'fifty-two', 'Age'] = '52'
df_HR.loc[df_HR['Age'] == 'thirty-one', 'Age'] = '31'
df_HR.loc[df_HR['Age'] == 'thirty', 'Age'] = '30'
df_HR.loc[df_HR['Age'] == 'twenty-six', 'Age'] = '26'
df_HR.loc[df_HR['Age'] == 'thirty-seven', 'Age'] = '37'
df_HR.loc[df_HR['Age'] == 'thirty-two', 'Age'] = '32'
df_HR.loc[df_HR['Age'] == 'thirty-seven', 'Age'] = '37'
df_HR.loc[df_HR['Age'] == 'twenty-four', 'Age'] = '24'

df_HR['Age']= df_HR['Age'].astype(int)
df_HR['Age'].dtype

dtype('int64')

In [26]:
#Buscamos los valores negativos de la columna 'DistanceFromHome'
valores_negativos = df_HR[df_HR['DistanceFromHome'] < 0]['DistanceFromHome']
print(valores_negativos)
print('_________________________________________________')
print(f'Hay {valores_negativos.shape[0]} filas con valores negativos')

18     -13
24     -42
30     -37
41     -35
57     -26
        ..
1572   -29
1576   -24
1590   -35
1601   -43
1611   -13
Name: DistanceFromHome, Length: 192, dtype: int64
_________________________________________________
Hay 192 filas con valores negativos

In [27]:
#Sustituimos valores negativos por positivos
df_HR.loc[df_HR['DistanceFromHome'] < 0, 'DistanceFromHome'] = df_HR['DistanceFromHome'].abs()

#Comprobamos que ya no hay valores negativos
df_HR[df_HR['DistanceFromHome'] < 0]

Empty DataFrame
Columns: [Unnamed: 0, Age, Attrition, BusinessTravel, DailyRate, Department, DistanceFromHome, Education, EducationField, employeenumber, EnvironmentSatisfaction, Gender, HourlyRate, JobInvolvement, JobLevel, JobRole, JobSatisfaction, MaritalStatus, MonthlyIncome, MonthlyRate, NUMCOMPANIESWORKED, Over18, OverTime, PercentSalaryHike, PerformanceRating, RelationshipSatisfaction, StandardHours, StockOptionLevel, TOTALWORKINGYEARS, TrainingTimesLastYear, WORKLIFEBALANCE, YearsAtCompany, YearsInCurrentRole, YearsSinceLastPromotion, YEARSWITHCURRMANAGER, DateBirth, RoleDepartament, RemoteWork]
Index: []

In [28]:
#Corregimos errores tipográficos en la columna MaritalStatus... 
df_HR['MaritalStatus'].unique()

array([nan, 'Married', 'Divorced', 'Single', 'divorced', 'Marreid'],
      dtype=object)

In [29]:
#Como 'Marreid'.
df_HR.loc[df_HR['MaritalStatus'] == 'Marreid', 'MaritalStatus'] = 'Married'
df_HR['MaritalStatus'].unique()

#O 'divorced'.
df_HR.loc[df_HR['MaritalStatus'] == 'divorced', 'MaritalStatus'] = 'Divorced'
df_HR['MaritalStatus'].unique()

array([nan, 'Married', 'Divorced', 'Single'], dtype=object)

In [30]:
""" Mirar qué otras columnas podemos cambiar de typo porque no estén en el correcto, como NUMBERCHILDRENS.
Ver si alguna otra columna tiene muchos nulos y no nos interesa (de cara a eliminarla). """

' Mirar qué otras columnas podemos cambiar de typo porque no estén en el correcto, como NUMBERCHILDRENS.\nVer si alguna otra columna tiene muchos nulos y no nos interesa (de cara a eliminarla). '

In [31]:
#FASE 4
#Seudocódigo.
""" Usar como filtro los valores de la columna **Attrition**. Los valores == YES han abandonado la empresa. 
    Buscar su nivel de Satisfacción. Columnas Age, Gender, EnviromentSatisfaction, JobInvolvement, 
    JobSatisfaction, 'RelationshipSatisfaction, WORKLIFEBALANCE, YearsSinceLastPromotion, ¿ YEARSWITHCURRMANAGER ?, 
    Salary, RoleDepartament, NUMBERCHILDREN, DistanceFromHome - RemoteWork. """

" Usar como filtro los valores de la columna **Attrition**. Los valores == YES han abandonado la empresa. \n    Buscar su nivel de Satisfacción. Columnas Age, Gender, EnviromentSatisfaction, JobInvolvement, \n    JobSatisfaction, 'RelationshipSatisfaction, WORKLIFEBALANCE, YearsSinceLastPromotion, ¿ YEARSWITHCURRMANAGER ?, \n    Salary, RoleDepartament, NUMBERCHILDREN, DistanceFromHome - RemoteWork. "

In [32]:
df_HR.to_csv('df_HR_limpio.csv', index=False)

In [33]:
#ABRO el nuevo archivo, el limpio para seguir trabajando

df_limpio = pd.read_csv('df_HR_limpio.csv', index_col= 0)
df_limpio.head(2)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,DateBirth,RoleDepartament,RemoteWork
Unnamed: 0,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
0,51,No,NaN,684.0,NaN,6,3,NaN,"162,0",1,M,51.0,3,5,resEArch DIREcToR,3,NaN,19537.0,6462,7,Y,No,13,"3,0",3,NaN,0,NaN,5,3.0,20,NaN,15,15,1972,NaN,Yes
1,52,No,NaN,699.0,NaN,1,4,Life Sciences,"259,0",3,M,65.0,2,5,ManAGeR,3,NaN,19999.0,5678,0,NaN,NaN,14,"3,0",1,NaN,1,"34,0",5,3.0,33,NaN,11,9,1971,NaN,1

In [34]:
# Función para mapear los valores a 'yes' y 'no', RemoteWork
def map_values(value):
    if str(value).lower() in ['1', 'true', 'yes']:
        return 'yes'
    elif str(value).lower() in ['0', 'false', 'no']:
        return 'no'
    else:
        return value  

# Aplicar la función a la columna
df_limpio['RemoteWork'] = df_limpio['RemoteWork'].apply(map_values)

In [35]:
df_limpio.sample(5)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeenumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NUMCOMPANIESWORKED,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TOTALWORKINGYEARS,TrainingTimesLastYear,WORKLIFEBALANCE,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,DateBirth,RoleDepartament,RemoteWork
Unnamed: 0,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
47,43,No,NaN,394.0,NaN,26,2,NaN,"158,0",3,M,92.0,3,4,maNaGeR,4,Married,16959.0,19494,1,NaN,Yes,12,"3,0",4,"80,0",2,"25,0",3,4.0,25,NaN,4,12,1980,NaN,yes
1050,36,No,NaN,329.0,NaN,16,4,Marketing,"1436,0",3,F,98.0,2,2,SaLEs eXEcUtiVe,1,NaN,5647.0,13494,4,NaN,No,13,"3,0",1,"80,0",2,"11,0",3,2.0,3,NaN,0,2,1987,NaN,no
61,37,No,NaN,1063.0,NaN,25,5,NaN,"529,0",2,F,72.0,3,2,RESEaRCh sCIENtIst,3,Married,NaN,23866,3,Y,Yes,15,"3,0",1,"80,0",2,"15,0",2,3.0,13,NaN,10,7,1986,NaN,no
1143,34,No,NaN,735.0,NaN,3,1,NaN,NaN,4,F,75.0,2,2,saLEs ExEcutIve,4,Married,8103.0,16495,3,NaN,Yes,12,"3,0",3,NaN,0,"9,0",3,2.0,4,NaN,0,1,1989,NaN,yes
482,34,No,NaN,704.0,Sales,28,3,Marketing,"2035,0",4,F,95.0,2,2,saLes EXEcuTiVe,3,Married,6712.0,8978,1,Y,No,21,"4,0",4,NaN,2,"8,0",2,3.0,8,NaN,1,7,1989,saLes EXEcuTiVe - Sales,no

In [36]:
df_HR["JobRole"] = df_HR["JobRole"].str.title()
df_HR["RoleDepartament"] = df_HR["RoleDepartament"].str.title()
df_HR.rename(columns={'TOTALWORKINGYEARS': 'TotalWorkingYears'}, inplace=True)
df_HR.rename(columns={'employeenumber': 'EmployeeNumber'}, inplace=True)
df_HR.rename(columns={'NUMCOMPANIESWORKED': 'NumCompaniesWorked'}, inplace=True)
df_HR.rename(columns={'WORKLIFEBALANCE': 'WorkLifeBalance'}, inplace=True)
df_HR.rename(columns={'YEARSWITHCURRMANAGER': 'YearsWithCurrManager'}, inplace=True)

In [37]:
df_HR.sample(10)

,Unnamed: 0,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeNumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NumCompaniesWorked,Over18,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager,DateBirth,RoleDepartament,RemoteWork
951,951,36,No,travel_rarely,1041.0,NaN,13,3,Human Resources,NaN,3,M,36.0,3,1,Human Resources,2,Married,NaN,25527,4,Y,NaN,13,"3,0",2,NaN,1,NaN,2,3.0,5,NaN,0,4,1987,NaN,1
1159,1159,21,No,travel_rarely,501.0,Sales,5,1,Medical,NaN,3,M,58.0,3,1,Sales Representative,1,Single,NaN,25479,1,NaN,NaN,11,"3,0",4,NaN,0,NaN,6,3.0,2,NaN,1,2,2002,Sales Representative - Sales,True
229,229,31,Yes,travel_frequently,1445.0,NaN,1,5,NaN,"1459,0",3,F,100.0,4,3,Manufacturing Director,2,NaN,7446.0,8931,1,Y,NaN,11,"3,0",1,NaN,0,NaN,2,3.0,10,NaN,4,7,1992,NaN,1
144,144,31,No,travel_rarely,1062.0,NaN,24,3,Medical,"1252,0",3,F,96.0,2,2,Healthcare Representative,1,Single,NaN,17198,1,NaN,No,19,NaN,2,NaN,0,"10,0",2,3.0,10,NaN,1,8,1992,NaN,False
734,734,24,No,NaN,477.0,NaN,24,3,Medical,NaN,4,M,49.0,3,1,Laboratory Technician,2,Single,3597.0,6409,8,NaN,No,22,"4,0",4,NaN,0,"6,0",2,3.0,4,NaN,1,2,1999,NaN,False
1145,1145,45,No,travel_frequently,NaN,NaN,1,4,Medical,"1922,0",2,M,44.0,3,2,Healthcare Representative,3,Single,5399.0,14511,4,Y,No,12,"3,0",3,"80,0",0,"12,0",3,3.0,4,NaN,0,3,1978,NaN,Yes
1556,1556,37,No,NaN,1319.0,NaN,6,3,Medical,NaN,3,M,51.0,4,2,Research Scientist,1,Divorced,5974.0,17001,4,NaN,NaN,13,"3,0",1,"80,0",2,"13,0",2,3.0,7,NaN,6,7,1986,NaN,Yes
986,986,26,Yes,non-travel,265.0,NaN,29,2,Medical,"1037,0",2,M,79.0,1,2,Sales Executive,1,Single,4969.0,21813,8,Y,No,18,"3,0",4,"80,0",0,NaN,6,3.0,2,NaN,2,2,1997,NaN,Yes
1315,1315,29,No,NaN,NaN,Sales,44,2,Medical,"690,0",2,F,62.0,3,2,Sales Executive,3,NaN,NaN,3487,1,Y,No,14,"3,0",1,NaN,1,NaN,5,2.0,6,NaN,1,2,1994,Sales Executive - Sales,0
485,485,34,No,travel_rarely,419.0,NaN,7,4,NaN,"28,0",1,F,53.0,3,3,Research Director,2,Single,NaN,21293,0,NaN,No,11,NaN,3,NaN,0,NaN,4,3.0,12,"6,0",2,11,1989,NaN,0

In [38]:
df_HR.to_csv("df_HR_limpio.csv", index = False)

In [39]:
# Eliminamos tres columna más
lista_eliminar = ["Over18", "StandardHours", "RoleDepartament", "Department", "YearsInCurrentRole"]
df_HR.drop(columns= lista_eliminar, inplace= True)

In [40]:
df_HR.columns

Index(['Unnamed: 0', 'Age', 'Attrition', 'BusinessTravel', 'DailyRate',
       'DistanceFromHome', 'Education', 'EducationField', 'EmployeeNumber',
       'EnvironmentSatisfaction', 'Gender', 'HourlyRate', 'JobInvolvement',
       'JobLevel', 'JobRole', 'JobSatisfaction', 'MaritalStatus',
       'MonthlyIncome', 'MonthlyRate', 'NumCompaniesWorked', 'OverTime',
       'PercentSalaryHike', 'PerformanceRating', 'RelationshipSatisfaction',
       'StockOptionLevel', 'TotalWorkingYears', 'TrainingTimesLastYear',
       'WorkLifeBalance', 'YearsAtCompany', 'YearsSinceLastPromotion',
       'YearsWithCurrManager', 'DateBirth', 'RemoteWork'],
      dtype='object')

In [41]:
# FUNCIÓN DE CONTEO DE FRECUENCIAS DE CADA COLUMNA

# EJECUTAR Y ABRIR EN TEXT EDITOR PARA VISUALIZAR LOS RESULTADOS EN UN ARCHIVO INDEPENDIENTE

def count_frequencies(df):
    # Creamos un diccionario para almacenar los resultados
    frequency_counts = {}
    
    # Recorremos todas las columnas del DataFrame
    for column in df_HR.columns:
        # Aplicar .value_counts() a cada columna y almacenarlo en el diccionario
        frequency_counts[column] = df[column].value_counts()
    
    return frequency_counts

# Llamamos a la función y obtenemos el conteo de frecuencia de cada columna
frequency_counts = count_frequencies(df_HR)

# Mostramos los resultados
for column, counts in frequency_counts.items():
    print(f"Conteo de frecuencias para la columna {column}:")
    print(counts)
    print()  # Línea en blanco para separar los resultados

Conteo de frecuencias para la columna Unnamed: 0:
0       1
1072    1
1082    1
1081    1
1080    1
       ..
535     1
534     1
533     1
532     1
1613    1
Name: Unnamed: 0, Length: 1614, dtype: int64

Conteo de frecuencias para la columna Age:
35    84
31    83
34    83
29    78
36    75
32    66
38    64
30    64
33    61
40    60
27    54
37    54
28    53
42    50
45    48
41    46
26    46
39    45
43    40
46    38
44    34
50    31
24    27
47    27
25    27
55    25
49    25
54    20
51    20
53    20
48    20
52    19
56    17
22    16
21    16
58    15
23    15
20    11
59    10
19     9
18     8
60     5
57     5
Name: Age, dtype: int64

Conteo de frecuencias para la columna Attrition:
No     1355
Yes     259
Name: Attrition, dtype: int64

Conteo de frecuencias para la columna BusinessTravel:
travel_rarely        586
travel_frequently    165
non-travel            91
Name: BusinessTravel, dtype: int64

Conteo de frecuencias para la columna DailyRate:
691.0    7
329.0    7
147.0    6
408.0    6
530.0    6
        ..
317.0    1
891.0    1
759.0    1
483.0    1
105.0    1
Name: DailyRate, Length: 848, dtype: int64

Conteo de frecuencias para la columna DistanceFromHome:
2     217
1     203
10     91
9      85
8      81
7      80
3      79
5      62
6      61
4      61
24     35
16     35
12     32
11     31
13     30
15     30
25     30
18     30
29     29
23     29
26     28
14     27
19     22
20     22
17     22
22     21
21     21
28     19
27     17
47      7
38      7
35      7
31      6
42      6
36      6
48      5
46      5
45      5
41      4
32      4
37      4
30      4
33      3
44      3
34      2
49      2
43      2
39      1
40      1
Name: DistanceFromHome, dtype: int64

Conteo de frecuencias para la columna Education:
3    621
4    445
2    314
1    180
5     54
Name: Education, dtype: int64

Conteo de frecuencias para la columna EducationField:
Life Sciences       349
Medical             276
Marketing           104
Technical Degree     69
Other                59
Human Resources      12
Name: EducationField, dtype: int64

Conteo de frecuencias para la columna EmployeeNumber:
482,0     2
530,0     2
507,0     2
517,0     2
522,0     2
         ..
161,0     1
164,0     1
190,0     1
194,0     1
2040,0    1
Name: EmployeeNumber, Length: 1079, dtype: int64

Conteo de frecuencias para la columna EnvironmentSatisfaction:
4     460
3     459
1     298
2     297
12      7
35      6
13      6
14      5
24      5
47      5
36      4
48      4
41      4
46      4
42      4
45      3
11      3
22      3
17      3
18      3
20      3
25      3
27      3
37      2
29      2
19      2
38      2
31      2
15      2
16      2
26      1
39      1
10      1
49      1
21      1
28      1
33      1
43      1
Name: EnvironmentSatisfaction, dtype: int64

Conteo de frecuencias para la columna Gender:
M    971
F    643
Name: Gender, dtype: int64

Conteo de frecuencias para la columna HourlyRate:
42.0    33
66.0    32
48.0    30
84.0    29
57.0    29
        ..
47.0    15
68.0    13
53.0    13
38.0    12
34.0    11
Name: HourlyRate, Length: 71, dtype: int64

Conteo de frecuencias para la columna JobInvolvement:
3    955
2    406
4    164
1     89
Name: JobInvolvement, dtype: int64

Conteo de frecuencias para la columna JobLevel:
2    597
1    586
3    242
4    113
5     76
Name: JobLevel, dtype: int64

Conteo de frecuencias para la columna JobRole:
 Sales Executive               369
 Research Scientist            314
 Laboratory Technician         278
 Manufacturing Director        158
 Healthcare Representative     149
 Manager                       111
 Sales Representative           90
 Research Director              88
 Human Resources                57
Name: JobRole, dtype: int64

Conteo de frecuencias para la columna JobSatisfaction:
4    514
3    481
1    317
2    302
Name: JobSatisfaction, dtype: int64

Conteo de frecuencias para la columna MaritalStatus:
Married     439
Single      325
Divorced    199
Name: MaritalStatus, dtype: int64

Conteo de frecuencias para la columna MonthlyIncome:
6347.0     4
5304.0     4
2657.0     3
2258.0     3
5405.0     2
          ..
3102.0     1
4556.0     1
4230.0     1
4859.0     1
19431.0    1
Name: MonthlyIncome, Length: 668, dtype: int64

Conteo de frecuencias para la columna MonthlyRate:
9150     4
11737    3
17001    3
6069     3
21981    3
        ..
25470    1
10205    1
9973     1
17089    1
16642    1
Name: MonthlyRate, Length: 1427, dtype: int64

Conteo de frecuencias para la columna NumCompaniesWorked:
1    573
0    226
3    169
4    157
2    156
7     84
6     73
5     66
9     59
8     51
Name: NumCompaniesWorked, dtype: int64

Conteo de frecuencias para la columna OverTime:
No     682
Yes    256
Name: OverTime, dtype: int64

Conteo de frecuencias para la columna PercentSalaryHike:
11    232
13    230
12    225
14    220
15    110
18     98
17     88
16     86
19     82
20     60
22     59
21     51
23     29
24     25
25     19
Name: PercentSalaryHike, dtype: int64

Conteo de frecuencias para la columna PerformanceRating:
3,0    1205
4,0     214
Name: PerformanceRating, dtype: int64

Conteo de frecuencias para la columna RelationshipSatisfaction:
3    504
4    468
2    339
1    303
Name: RelationshipSatisfaction, dtype: int64

Conteo de frecuencias para la columna StockOptionLevel:
0    687
1    666
2    172
3     89
Name: StockOptionLevel, dtype: int64

Conteo de frecuencias para la columna TotalWorkingYears:
10,0    144
8,0      86
6,0      84
9,0      69
5,0      66
7,0      56
4,0      54
1,0      53
12,0     34
3,0      32
14,0     30
13,0     30
11,0     29
15,0     28
16,0     28
20,0     28
18,0     27
21,0     23
17,0     22
2,0      21
22,0     18
19,0     17
24,0     14
23,0     13
28,0     13
26,0      8
0,0       8
29,0      6
36,0      6
25,0      6
33,0      6
37,0      5
27,0      5
31,0      4
30,0      3
32,0      3
35,0      3
40,0      3
34,0      2
38,0      1
Name: TotalWorkingYears, dtype: int64

Conteo de frecuencias para la columna TrainingTimesLastYear:
2    598
3    534
4    137
5    136
1     77
6     72
0     60
Name: TrainingTimesLastYear, dtype: int64

Conteo de frecuencias para la columna WorkLifeBalance:
3.0    913
2.0    359
4.0    155
1.0     79
Name: WorkLifeBalance, dtype: int64

Conteo de frecuencias para la columna YearsAtCompany:
5     208
1     171
3     141
2     141
10    133
7     115
4     114
8     106
9      94
6      78
0      44
11     36
20     29
13     26
15     21
14     19
22     17
12     15
18     15
16     14
21     14
19     12
17      9
24      7
25      5
33      5
26      4
32      3
27      3
31      3
36      3
29      2
23      2
40      2
34      1
37      1
30      1
Name: YearsAtCompany, dtype: int64

Conteo de frecuencias para la columna YearsSinceLastPromotion:
0     625
1     384
2     177
7      93
4      67
3      62
5      53
6      37
11     26
8      20
9      18
15     15
12     11
13     10
14     10
10      6
Name: YearsSinceLastPromotion, dtype: int64

Conteo de frecuencias para la columna YearsWithCurrManager:
2     380
0     270
7     267
3     148
8     115
4     104
1      84
9      70
5      36
10     31
6      30
11     22
12     20
13     16
17      8
15      5
14      5
16      3
Name: YearsWithCurrManager, dtype: int64

Conteo de frecuencias para la columna DateBirth:
1988    84
1992    83
1989    83
1994    78
1987    75
1991    65
1985    64
1993    64
1990    61
1983    60
1986    55
1996    54
1995    53
1981    50
1978    48
1982    46
1997    46
1984    45
1980    40
1977    38
1979    34
1973    31
1999    27
1976    27
1998    27
1968    25
1974    25
1969    20
1972    20
1970    20
1975    20
1971    19
1967    17
2001    16
2002    16
1965    15
2000    15
2003    11
1964    10
2004     9
2005     8
1963     5
1966     5
Name: DateBirth, dtype: int64

Conteo de frecuencias para la columna RemoteWork:
1        360
True     345
0        309
False    305
Yes      295
Name: RemoteWork, dtype: int64

In [42]:
# Eliminamos los nulos de la columna EmployeeNumber
df_HR = df_HR.drop_duplicates(subset=['EmployeeNumber'])

In [43]:
# Comprobamos que se han eliminado los nulos
df_HR["EmployeeNumber"].duplicated().sum()

0

In [44]:
df_HR.shape

(1080, 33)

In [45]:
""" Para obtener los duplicados de todas las columnas

for columna in df_HR:
    num_filas_duplicadas = df_HR[columna].duplicated().sum()
    print(f'{columna.upper()}: {num_filas_duplicadas}')"""

" Para obtener los duplicados de todas las columnas\n\nfor columna in df_HR:\n    num_filas_duplicadas = df_HR[columna].duplicated().sum()\n    print(f'{columna.upper()}: {num_filas_duplicadas}')"

In [46]:
# Para obtener los duplicados de todas las columnas

for columna in df_HR:
    num_filas_nulas = df_HR[columna].isnull().sum()
    print(f'{columna.upper()}: {num_filas_nulas}')

UNNAMED: 0: 0
AGE: 0
ATTRITION: 0
BUSINESSTRAVEL: 534
DAILYRATE: 85
DISTANCEFROMHOME: 0
EDUCATION: 0
EDUCATIONFIELD: 496
EMPLOYEENUMBER: 1
ENVIRONMENTSATISFACTION: 0
GENDER: 0
HOURLYRATE: 62
JOBINVOLVEMENT: 0
JOBLEVEL: 0
JOBROLE: 0
JOBSATISFACTION: 0
MARITALSTATUS: 425
MONTHLYINCOME: 560
MONTHLYRATE: 0
NUMCOMPANIESWORKED: 0
OVERTIME: 447
PERCENTSALARYHIKE: 0
PERFORMANCERATING: 137
RELATIONSHIPSATISFACTION: 0
STOCKOPTIONLEVEL: 0
TOTALWORKINGYEARS: 360
TRAININGTIMESLASTYEAR: 0
WORKLIFEBALANCE: 69
YEARSATCOMPANY: 0
YEARSSINCELASTPROMOTION: 0
YEARSWITHCURRMANAGER: 0
DATEBIRTH: 0
REMOTEWORK: 0

## Gestión de nulos de columnas categóricas

In [47]:
# Calculamos el porcentaje de nulos que tenemos para cada columna categórica
porc_nulos = (df_HR.isnull().sum() / df_HR.shape[0]) * 100
porc_nulos

# Lo convertimos a DataFrame
df_nulos = pd.DataFrame(porc_nulos, columns = ["%_nulos"])

# Filtramos el DataFrame para quedarnos solo con aquellas columnas que tengan nulos
df_nulos[df_nulos["%_nulos"] > 0]

                     %_nulos
BusinessTravel     49.444444
DailyRate           7.870370
EducationField     45.925926
EmployeeNumber      0.092593
HourlyRate          5.740741
MaritalStatus      39.351852
MonthlyIncome      51.851852
OverTime           41.388889
PerformanceRating  12.685185
TotalWorkingYears  33.333333
WorkLifeBalance     6.388889

In [48]:
# Obtenemos la lista de columnas categóricas que tienen nulos
nulos_esta_cat = df_HR[df_HR.columns[df_HR.isnull().any()]].select_dtypes(include = "O").columns
print("Las columnas categóricas que tienen nulos son : \n ")
print(nulos_esta_cat)

Las columnas categóricas que tienen nulos son :

Index(['BusinessTravel', 'EducationField', 'EmployeeNumber', 'MaritalStatus',
       'OverTime', 'PerformanceRating', 'TotalWorkingYears'],
      dtype='object')

In [49]:
# Sacamos el 'value_counts()' de cada una de las columnas categóricas que tienen nulos para saber como es la distribución de sus categorías
for col in nulos_esta_cat:
    print(f"La distribución de las categorías para la columna {col.upper()}")
    display(df_HR[col].value_counts() / df_HR.shape[0] * 100)  # display es una función utilizada para mostrar objetos de manera más legible en Jupyter Notebooks o entornos similares. 
    print("........................")

La distribución de las categorías para la columna BUSINESSTRAVEL

travel_rarely        34.814815
travel_frequently    10.185185
non-travel            5.555556
Name: BusinessTravel, dtype: float64

........................
La distribución de las categorías para la columna EDUCATIONFIELD

Life Sciences       22.037037
Medical             16.388889
Marketing            7.129630
Technical Degree     4.444444
Other                3.518519
Human Resources      0.555556
Name: EducationField, dtype: float64

........................
La distribución de las categorías para la columna EMPLOYEENUMBER

162,0     0.092593
1027,0    0.092593
896,0     0.092593
902,0     0.092593
916,0     0.092593
            ...
905,0     0.092593
942,0     0.092593
1026,0    0.092593
1085,0    0.092593
2040,0    0.092593
Name: EmployeeNumber, Length: 1079, dtype: float64

........................
La distribución de las categorías para la columna MARITALSTATUS

Married     26.759259
Single      21.666667
Divorced    12.222222
Name: MaritalStatus, dtype: float64

........................
La distribución de las categorías para la columna OVERTIME

No     41.574074
Yes    17.037037
Name: OverTime, dtype: float64

........................
La distribución de las categorías para la columna PERFORMANCERATING

3,0    73.981481
4,0    13.333333
Name: PerformanceRating, dtype: float64

........................
La distribución de las categorías para la columna TOTALWORKINGYEARS

10,0    9.166667
6,0     5.277778
8,0     4.537037
9,0     4.444444
5,0     4.351852
7,0     3.425926
1,0     3.333333
4,0     3.240741
12,0    2.129630
14,0    2.037037
3,0     1.944444
20,0    1.944444
15,0    1.851852
11,0    1.666667
13,0    1.574074
21,0    1.574074
16,0    1.481481
18,0    1.481481
17,0    1.388889
2,0     1.203704
22,0    1.111111
19,0    1.018519
23,0    1.018519
26,0    0.740741
24,0    0.648148
28,0    0.648148
0,0     0.462963
29,0    0.370370
33,0    0.370370
25,0    0.370370
32,0    0.277778
31,0    0.277778
37,0    0.277778
27,0    0.277778
36,0    0.185185
30,0    0.185185
35,0    0.092593
38,0    0.092593
40,0    0.092593
34,0    0.092593
Name: TotalWorkingYears, dtype: float64

........................

In [52]:
# Sustituimos los valores nulos de las siguientes columnas por "Unkown", ya que no hay mayorías claras que nos permitan imputar.

columnas_desconocido = ['BusinessTravel', 'EducationField', 'EmployeeNumber',
       'MaritalStatus', 'OverTime', 'PerformanceRating', 'TotalWorkingYears']
    
    
for columna in columnas_desconocido:
    
    # reemplazamos los nulos por el valor Unknown para cada una de las columnas de la lista
    df_HR[columna] = df_HR[columna].fillna("Unknown")
    
# comprobamos si quedan nulos en las columnas categóricas. 
print("Después del reemplazo usando 'fillna' quedan los siguientes nulos")
df_HR[columnas_desconocido].isnull().sum()

Después del reemplazo usando 'fillna' quedan los siguientes nulos

BusinessTravel       0
EducationField       0
EmployeeNumber       0
MaritalStatus        0
OverTime             0
PerformanceRating    0
TotalWorkingYears    0
dtype: int64

In [ ]:
df_HR.columns

Index(['Unnamed: 0', 'Age', 'Attrition', 'BusinessTravel', 'DailyRate',
       'DistanceFromHome', 'Education', 'EducationField', 'EmployeeNumber',
       'EnvironmentSatisfaction', 'Gender', 'HourlyRate', 'JobInvolvement',
       'JobLevel', 'JobRole', 'JobSatisfaction', 'MaritalStatus',
       'MonthlyIncome', 'MonthlyRate', 'NumCompaniesWorked', 'OverTime',
       'PercentSalaryHike', 'PerformanceRating', 'RelationshipSatisfaction',
       'StockOptionLevel', 'TotalWorkingYears', 'TrainingTimesLastYear',
       'WorkLifeBalance', 'YearsAtCompany', 'YearsInCurrentRole',
       'YearsSinceLastPromotion', 'YearsWithCurrManager', 'DateBirth',
       'RemoteWork'],
      dtype='object')

In [53]:
df_HR.head()

,Unnamed: 0,Age,Attrition,BusinessTravel,DailyRate,DistanceFromHome,Education,EducationField,EmployeeNumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate,NumCompaniesWorked,OverTime,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsSinceLastPromotion,YearsWithCurrManager,DateBirth,RemoteWork
0,0,51,No,Unknown,684.0,6,3,Unknown,"162,0",1,M,51.0,3,5,Research Director,3,Unknown,19537.0,6462,7,No,13,"3,0",3,0,Unknown,5,3.0,20,15,15,1972,Yes
1,1,52,No,Unknown,699.0,1,4,Life Sciences,"259,0",3,M,65.0,2,5,Manager,3,Unknown,19999.0,5678,0,Unknown,14,"3,0",1,1,"34,0",5,3.0,33,11,9,1971,1
2,2,42,No,travel_rarely,532.0,4,2,Technical Degree,"319,0",3,M,58.0,3,5,Manager,4,Married,19232.0,4933,1,No,11,"3,0",4,0,"22,0",3,NaN,22,11,15,1981,1
3,3,47,No,travel_rarely,359.0,2,4,Medical,Unknown,1,F,82.0,3,4,Research Director,3,Married,17169.0,26703,3,Unknown,19,"3,0",2,2,Unknown,2,NaN,20,5,6,1976,False
5,5,48,No,Unknown,117.0,22,3,Medical,"1900,0",4,F,58.0,3,4,Manager,4,Unknown,17174.0,2437,3,No,11,"3,0",2,1,Unknown,3,3.0,22,4,7,1975,Yes

In [ ]:
df_HR.dtypes

Unnamed: 0                    int64
Age                           int64
Attrition                    object
BusinessTravel               object
DailyRate                   float64
DistanceFromHome              int64
Education                     int64
EducationField               object
EmployeeNumber               object
EnvironmentSatisfaction       int64
Gender                       object
HourlyRate                  float64
JobInvolvement                int64
JobLevel                      int64
JobRole                      object
JobSatisfaction               int64
MaritalStatus                object
MonthlyIncome               float64
MonthlyRate                   int64
NumCompaniesWorked            int64
OverTime                     object
PercentSalaryHike             int64
PerformanceRating            object
RelationshipSatisfaction      int64
StockOptionLevel              int64
TotalWorkingYears            object
TrainingTimesLastYear         int64
WorkLifeBalance             float64
YearsAtCompany                int64
YearsInCurrentRole           object
YearsSinceLastPromotion       int64
YearsWithCurrManager          int64
DateBirth                     int64
RemoteWork                   object
dtype: object

## Gestión de nulos de columnas numéricas

In [54]:
# Obtenemos la lista de columnas numericas que tienen nulos
nulos_esta_num = df_HR[df_HR.columns[df_HR.isnull().any()]].select_dtypes(include = np.number).columns
print("Las columnas numéricas que tienen nulos son : \n ")
print(nulos_esta_num)

Las columnas numéricas que tienen nulos son :

Index(['DailyRate', 'HourlyRate', 'MonthlyIncome', 'WorkLifeBalance'], dtype='object')

In [57]:
# Calculamos el porcentaje de nulos que tenemos en cada una de las columnas numericas
df_HR[nulos_esta_num].isnull().sum() / df_HR.shape[0] *100

DailyRate           7.870370
HourlyRate          5.740741
MonthlyIncome      51.851852
WorkLifeBalance     6.388889
dtype: float64